ИТ_Фирма/src/InformationRegisters/ЦеныПродажиНоменклатуры/ЦеныПродажиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПродажиНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Денежный</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИТ_Фирма/src/InformationRegisters/Скидки/Скидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Скидки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НоменклатураНоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИТ_Фирма/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СтандартнаяУпаковка</name>
    <type>
      <types>CatalogRef.Упаковки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
</mdclass:Catalog>

ИТ_Фирма/src/CommonModules/ЦеныСервер/Module.bsl
Функция ЦенаНаДату(Номенклатура, Дата) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ЦеныПродажиНоменклатурыСрезПоследних.Цена, 0) КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныПродажиНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК ЦеныПродажиНоменклатурыСрезПоследних";	
	
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);  
	Запрос.УстановитьПараметр("Период", Дата);

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаРезультата = РезультатЗапроса.Выбрать();
	
	ВыборкаРезультата.Следующий();		
	
	Возврат ВыборкаРезультата.Цена; 	
КонецФункции	

Функция СкидкаНаДату(Номенклатура, Дата) Экспорт

    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СкидкаНаГруппу.СкидкаГруппы, 0) КАК СкидкаГруппы,
	               |	ЕСТЬNULL(СкидкаНаНоменклатуру.СкидкаНоменклатуры, 0) КАК СкидкаНоменклатуры
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Номенклатура.Ссылка КАК Ссылка,
	               |		ЕСТЬNULL(СкидкиСрезПоследних.Скидка, 0) КАК СкидкаГруппы
	               |	ИЗ
	               |		РегистрСведений.Скидки.СрезПоследних(
	               |				&Период,
	               |				НоменклатураНоменклатурнаяГруппа В
	               |					(ВЫБРАТЬ
	               |						Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	               |					ИЗ
	               |						Справочник.Номенклатура КАК Номенклатура
	               |					ГДЕ
	               |						Номенклатура.Ссылка = &Номенклатура)) КАК СкидкиСрезПоследних
	               |			ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	               |			ПО СкидкиСрезПоследних.НоменклатураНоменклатурнаяГруппа = Номенклатура.НоменклатурнаяГруппа
	               |	ГДЕ
	               |		Номенклатура.Ссылка = &Номенклатура) КАК СкидкаНаГруппу,
	               |	(ВЫБРАТЬ
	               |		ЕСТЬNULL(СкидкиСрезПоследних.Скидка, 0) КАК СкидкаНоменклатуры,
	               |		Номенклатура.Ссылка КАК Ссылка
	               |	ИЗ
	               |		РегистрСведений.Скидки.СрезПоследних(&Период, НоменклатураНоменклатурнаяГруппа = &Номенклатура) КАК СкидкиСрезПоследних
	               |			ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	               |			ПО СкидкиСрезПоследних.НоменклатураНоменклатурнаяГруппа = Номенклатура.Ссылка
	               |	ГДЕ
	               |		Номенклатура.Ссылка = &Номенклатура) КАК СкидкаНаНоменклатуру";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаРезультата = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаРезультата.Следующий() Цикл
		Если ВыборкаРезультата.СкидкаНоменклатуры = 0 Тогда
			Скидка = ВыборкаРезультата.СкидкаГруппы;
		Иначе 
			Скидка = ВыборкаРезультата.СкидкаНоменклатуры;
		КонецЕсли	
	КонецЦИкла;		
	Возврат Скидка;	

КонецФункции	

Функция СтавкаНДСНаДату(Номенклатура, Дата) Экспорт
	
	Запрос = новый Запрос;
	ЗАпрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура";
	
    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаЗапроса.Следующий();
	
	Возврат ВыборкаЗапроса.СтавкаНДС;
КонецФункции
